src/InformationRegisters/ГП_ЗданияБП77.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГП_ЗданияБП77</Name>
			<Comment>// Гарант+</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектАбонентаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УлицаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УлицаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УлицаКодГорода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Улица2</Name>
					<Comment>Улица, проспект и т. п.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодМКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реквизиты</Name>
					<Comment>Контактные реквизиты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоДляКанализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентХВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентГВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролерКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролерНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетчикКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетчикНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПотребителяКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПотребителяНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоНегативноеВоздействиеЦСВ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПлатаЗаХолодноеВодоснабжениеОИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаХВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаГВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодРасчетаКан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаПодогрев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеНачислять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДоговорКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>85</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодозаборКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодозаборНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КонтрагентКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАбонентаКод</Name>
					<Comment>Код объекта абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КВП_Здания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГП_ЗданияБП77/Ext/ManagerModule.bsl
// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область ПрограммныйИнтерфейс

// Заполняет значения признака `ЭтоНегативноеВоздействиеЦСВ` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
Функция ЗаполнитьПризнакНегативноеВоздействие() Экспорт
    РезультатФункции = Новый Структура("Успех, КоличествоИзмененныхСтрок, СообщениеОбОшибке", Истина, 0);

    НаборВсехЗаписейРегистра = СоздатьПустойНаборЗаписей();
    НаборВсехЗаписейРегистра.Прочитать();

    Для Каждого ТекущаяСтрока Из НаборВсехЗаписейРегистра Цикл
        ТекущееЗначениеЭтоНегативноеВоздействие = ТекущаяСтрока.ЭтоНегативноеВоздействиеЦСВ;
        ТекущаяСтрока.ЭтоНегативноеВоздействиеЦСВ =
            ГП_МиграцияОбщегоНазначения.ЭтоНаименованиеУслугиНегативногоВоздействия(
                ТекущаяСтрока.ОбъектАбонентаНаименование);

        Если ТекущееЗначениеЭтоНегативноеВоздействие <> ТекущаяСтрока.ЭтоНегативноеВоздействиеЦСВ Тогда
            РезультатФункции.КоличествоИзмененныхСтрок = РезультатФункции.КоличествоИзмененныхСтрок + 1;
        КонецЕсли;
    КонецЦикла;

    Попытка
        НаборВсехЗаписейРегистра.Записать();
    Исключение
        ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
            "Ошибка при записи в регистр сведений ""Услуги БП 7.7"" при обновлении значений признака негативного воздействия.",
            УровеньЖурналаРегистрации.Ошибка, , ,
            ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

        РезультатФункции.КоличествоИзмененныхСтрок = 0;
        РезультатФункции.СообщениеОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
        РезультатФункции.Успех = Ложь;
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

// Заполняет значения признака `ЭтоПлатаЗаХолодноеВодоснабжениеОИ` для всех записей регистра.
//  Заполнение выполняется по данным наименования объекта абонента
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
Функция ЗаполнитьПризнакПлатаЗаХолодноеВодоснабжениеОИ() Экспорт
    РезультатФункции = Новый Структура("Успех, КоличествоИзмененныхСтрок, СообщениеОбОшибке", Истина, 0);

    НаборВсехЗаписейРегистра = СоздатьПустойНаборЗаписей();
    НаборВсехЗаписейРегистра.Прочитать();

    Для Каждого ТекущаяСтрока Из НаборВсехЗаписейРегистра Цикл
        ТекущееЗначениеЭтоПлатаЗаХолодноеВодоснабжениеОИ = ТекущаяСтрока.ЭтоПлатаЗаХолодноеВодоснабжениеОИ;
        ТекущаяСтрока.ЭтоПлатаЗаХолодноеВодоснабжениеОИ =
            ГП_МиграцияОбщегоНазначения.ЭтоНаименованиеУслугиХолодногоВодоснабженияОИ(
                ТекущаяСтрока.ОбъектАбонентаНаименование);

        Если ТекущееЗначениеЭтоПлатаЗаХолодноеВодоснабжениеОИ <> ТекущаяСтрока.ЭтоПлатаЗаХолодноеВодоснабжениеОИ Тогда
            РезультатФункции.КоличествоИзмененныхСтрок = РезультатФункции.КоличествоИзмененныхСтрок + 1;
        КонецЕсли;
    КонецЦикла;

    Попытка
        НаборВсехЗаписейРегистра.Записать();
    Исключение
        ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
            "Ошибка при записи в регистр сведений ""Услуги БП 7.7"" при обновлении значений признака платы за холодное водоснабжение ОИ.",
            УровеньЖурналаРегистрации.Ошибка, , ,
            ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

        РезультатФункции.КоличествоИзмененныхСтрок = 0;
        РезультатФункции.СообщениеОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
        РезультатФункции.Успех = Ложь;
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

// Заполняет значения поля `ДоговорНомер` для всех записей регистра.
//  Заполнение выполняется по данным наименования договора
// Возвращаемое значение:
//  - Структура
//      * Успех - Булево
//      * КоличествоИзмененныхСтрок - Число
Функция ЗаполнитьНомераДоговоров() Экспорт
    РезультатФункции = Новый Структура("Успех, КоличествоИзмененныхСтрок, СообщениеОбОшибке", Истина, 0);

    НаборВсехЗаписейРегистра = СоздатьПустойНаборЗаписей();
    НаборВсехЗаписейРегистра.Прочитать();

    Для Каждого ТекущаяСтрока Из НаборВсехЗаписейРегистра Цикл
        ТекущееЗначениеДоговорНомер = ТекущаяСтрока.ДоговорНомер;
        СтруктураНомера = ГП_МиграцияОбщегоНазначения.ПолучитьНомерДоговораПоНаименованию(
                ТекущаяСтрока.ДоговорНаименование);

        Если СтруктураНомера.Успех = Ложь Тогда
            Продолжить; // Номер не распознан
        КонецЕсли;

        ТекущаяСтрока.ДоговорНомер = СтруктураНомера.Номер + ?(ПустаяСтрока(СтруктураНомера.Суффикс),
                "", СтрШаблон("-%1", СтруктураНомера.Суффикс));

        Если ТекущееЗначениеДоговорНомер <> ТекущаяСтрока.ДоговорНомер Тогда
            РезультатФункции.КоличествоИзмененныхСтрок = РезультатФункции.КоличествоИзмененныхСтрок + 1;
        КонецЕсли;
    КонецЦикла;
    
    Попытка
        НаборВсехЗаписейРегистра.Записать();
    Исключение
        СтруктураОшибки =
            ГП_МиграцияОбщегоНазначения.ЗаписатьОшибкуВЖурнал(
                "Ошибка при записи в регистр сведений ""Услуги БП 7.7""
                |при обновлении значений поля Номер договора.", Ложь, Истина);

        РезультатФункции.КоличествоИзмененныхСтрок = 0;
        РезультатФункции.СообщениеОбОшибке = СтруктураОшибки.КраткоеПредставлениеОшибки;
        РезультатФункции.Успех = Ложь;
    КонецПопытки;

    Возврат РезультатФункции;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --

// ++ Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 ++
#Область СлужебныеПроцедурыИФункции

Функция СоздатьПустойНаборЗаписей()
    Возврат РегистрыСведений.ГП_ЗданияБП77.СоздатьНаборЗаписей();
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
// -- Гарант+ Килипенко 01.08.2024 [F00226689] перенос объектов абонентов из БП77 --
